BenchBnB/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
    def index
        @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "hey"], ["lat", 36.0], ["lng", 35.0], ["created_at", "2021-07-01 18:17:33.261492"], ["updated_at", "2021-07-01 18:17:33.261492"]]
---
    def create
        @bench = Bench.new(bench_params)
        if @bench && @bench.save