BenchBnB/app/controllers/api/users_controller.rb

INSERT INTO "users" ("password_digest", "session_token", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user && @user.save