BenchBnB/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "freefish"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gCeeXxxl_5ajVseRSk3iQA"], ["updated_at", "2021-06-29 21:16:08.704895"], ["id", 1]]